@echo off

@echo // +----------------------------------------------------------------------

@echo // ^| 一键pull

@echo // +----------------------------------------------------------------------

@echo // ^| 记得另存为ANSI格式，不然会乱码

@echo // +----------------------------------------------------------------------

@echo // ^| Blog ( https://blog.csdn.net/Jay_Chou345 )

@echo // +----------------------------------------------------------------------

set "branch=master"

set /p "branch=请输入拉取分支(回车则默认master)："

git pull origin %branch%

pause